#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# ========================================================
# 字符串
print('I\'m OK! I like "apple"')

print(
    """line1
...line2
...line3"""
)

# r'' or r"", 字符串内部数据不转义
print(r"\\\t\\")
print("\\\t\\")

# 交互命令行中, 可以使用 '''xxx''' 来进行多行输出
# 并且还可以配合r命令: r'''xxx'''

# ========================================================
# boolean
print(True, False)

# ========================================================
# 运算, 与或非
print(True and False, True or False, not True)
print(not 1 < 2)

# ========================================================
# 空值, None
print(None)


# ========================================================
# 变量
a = 123
print(a)
a = "ABC"
print(a)
# 常量, 一般用全部大写表示
PI = 3.14159265359
